routes/web.php

SELECT * FROM `posts`
SELECT * FROM `categories` WHERE `categories`.`id` in (1)
---
use App\Models\Category;
use Illuminate\Support\Facades\DB;

Route::get('/', function () {
    /**
     * Listen db and put in logger
     * */
    // DB::listen(function ($query) {
    //     logger($query->sql);
    // });

    return view('posts', [
        // Old way
        //'posts' => Post::all()
        // best way
        'posts' => Post::with('category')->get()

    ]);
});